import java.util.List;

public interface ProductRepository {
    Products findById(int id);
    int total();
    List<Products> findByPriseRage(int min, int max);
    int amount(int price);
//    Создать метод репозитории как будет который будет возвращать самый дорогой продукт
    Products findMaxProduct();
//Создать метод по истории которые будут возвращать сумму самого дорогого и самого дешёвого продуктов
    List<Products> findMaxMinProduct();
//    Создать метод репозитории который будет возвращаться название продукта перевёрнуто тех продукты цена будет отрицательной
//    Создать метод репозиторий который будет возвращать общую сумму всех продуктов который заканчивается на букву а
   int findTotalLastA();
//   Создать метод репозитории который будет возвращать количество продуктов у которых первые и последняя буква одинаковые
    int AmountFirstLast();
//Создать метод репозитории который будет возвращать
// количество продуктов которые заканчиваются на словосочетании переданное через аргумент
    int AmountLastName(String name);
}